{
  "1": ["万物のスタート新生発展の霊位を示す吉祥数", "「たとえ環境が不遇でも、富と幸福に恵まれ発展する強運数だけに、独立単行になりやすく敵も作ります。独走を慎んでいけば、困難を克服して地位や財運に恵まれて幸福な人生が展開します。」"],
  "2": ["強大な発展力と分離力を併合せる霊位を示す凶運数", "「気力が乏しく不安動揺に遭いやすいため、進取の気性に欠け不平不満が多く、身内のトラブルや交友関係に支障を来たすなど、孤独に見舞われ易い暗示があります。自己の境遇をわきまえ、片意地を張らず周辺との調和に心掛ける忍耐力を養えば、自己を安泰させることができます。」"],
  "3": ["智と徳を併有せる霊位を示す大吉祥数", "「知能向上、明朗活発で大志大業を成就する吉運数で運気が旺盛なだけに若年から急進的になりやすく、焦りますと理想敗けの危険もあります。焦らず人との調和に努め、一歩一歩進めば旺盛な気運と明るい人柄が好かれ弱冠にして栄光を勝ち取れます。」"],
  "4": ["変怪数四散の霊位を示す大凶数", "「神経質で片意地な自己中心型が多く、独立心弱く空回りをします。そのため中途挫折し易く頑固になる為、特に対人関係に支障が生じやすい気苦労の多い数です。自己の限界と境遇をわきまえ、人との融和に心掛けることで、協力者を得ることが自己安泰の秘訣となります。」"],
  "5": ["健全長生、円満の霊位を示す吉祥数", "「心身共に健全発展成功の地祥を得て、温和な性格と積極性に富む人柄が、衆人の信望を集めリーダとなり、逆境にあっても挫けない天与により、富栄や名誉が得られます。移り気で変化を好み、人の制約を嫌うタイプで、外柔内剛で病気に強い。家庭内で外柔内剛が表面化しないことと、情に脆い点で損をしないように注意が必要です。」"],
  "6": ["天徳地祥の霊位を示す吉祥数", "「福禄豊かな天賦の才能に恵まれ、温和な人柄が衆人の信望を集め、リーダの風格がいっそうその気運を助長し、富貴や名声を得る強運数だけに、裏面に親分肌な所があり、人の制約を嫌い反発性を持っています。人に親切でお節介をし過ぎる点は慎みまないと、人に利用されたり損をします。」"],
  "7": ["独立独歩、権威の霊位を示す吉数", "「権力型だけに向こう気が強く剛気果断のタイプ。プライドが強く決断力に富む強運数で、敗け惜しみが強く自我を表面化しますと、家庭内や社交上で不和を生じやすくなります。困難にも挫けない辛抱強さが天与ですから、自我を慎めば明るい人柄が好かれ幸運を得ます。<br>なお、7が重なっていますと、強すぎて悪い面ばかりがでる可能性があります。」"],
  "8": ["剛健忍耐の霊位を示す吉数", "「困難や障害にも挫けず、目的を貫く意志と忍耐力が成功発展の原動力となる末広がりの強運数だけに、頑固すぎる面があり、自己流に独歩しますと不和を生じ不利を招きます。他人への敬愛の念と協調心を養うように心掛ければ、多くの支持者を得て発展成功します。また、情に脆い面で損をしないように注意してください。」"],
  "9": ["悲運薄幸な霊位を示す凶運数", "「智力に優れ頭の回転が速いのですが、病弱薄幸で肉親の縁も薄く幼少にて親との生死別による孤独な生活や甚だしい時は短命の暗示がある大凶数です。他の数との組み合わせにもよりますが、多くは人のために損をしがちな苦労の多い人生をたどります。ただし才略優秀なる人は大成功者となります。」"],
  "10": ["虚無霊暗の霊位を示す大凶数", "「頭脳明晰なる者又は空虚な暗い気性の者、俊敏なる大活動家又はつまらないぐうたら者など両極端で、他の数に左右されます。(単独での判断は難しい)　多くは病弱薄幸で労して功を他に奪われる結果となり、あせる程に失敗を招き、素直さと明るさを欠き、人との対立が起き、短気を起こして自らが暗い人生を作ってしまいます。ただし才略秀ずる者は稀に大成功者となります。」"],
  "11": ["陰陽和合の天恵ある霊位を示す吉祥数", "「跡取りの相：長男でなくとも跡取りになることが多い。<br>温和な人柄で着実に努力して次第に富貴繁栄する吉祥数ですが、強運だけにワンマンになりやすく、お坊ちゃん気質になりますと気運が衰えますから、順和雅量を養うと強い発展をします。+w<br>女性のあなたは、長男に縁が多く、相手が長男の時は幸運な生涯を得ます。また、長男を避けると良縁を逸する場合もあります。+e<br>基礎運が11のあなたには特にその傾向が強く現れます。-e-w」"],
  "12": ["向上なるが薄幸挫折の霊位を示す凶運数", "「発展向上の気性が強く、他人に服従を嫌う野心家タイプ。意志薄弱で無気力に拘わらず、妄想的に向上心ばかりが強く、辛抱がないため、中途で挫折しやすく失敗が多い。人との対立を起こして神経質になるくよくよタイプ。片意地を張らず自分の限界知り、一筋道に専念し人との和合に努めることが成功の秘訣です。」"],
  "13": ["才智鋭敏の霊位を示す大吉祥数", "「学問技芸に富む器用な人気運。明朗闊達で周囲を明るく盛り立て苦難も巧みに切り抜け、晩年発展し長寿をまっとうする吉祥数です。裏面が出ますと、少々急進的で感情に左右されると事を損じる危険性もありますから、一歩一歩進めば強い発展運が活かされ幸運な生涯となります。」"],
  "14": ["孤独神経質の霊位を示す大凶数", "「破兆があり、浮沈多く神経質、潔癖過ぎて他人に厳しく、そのくせ自分は身勝手なため、家庭運も悪く、夫婦親子の争いも生じやすい。自らが素直になって自分の限界を知り、人との和合に努める事が自らを救うことになります。+o<br>対人運にこの数字があるあなたは特に注意が必要です。-o」"],
  "15": ["福寿円満の霊位を示す大吉祥運", "「情味豊かな天賦ある福禄円満の象あり。温和に富み人当たり良く、よき協力者にも恵まれて、富貴・繁栄・有徳と三大徳を具現する大人しい頭領運で、幸福な生涯を得ます。+w<br>女性のあなたには最良の数です。-w」"],
  "16": ["頭領の才象望運の霊位を示す吉祥数", "「大器晩成、良い友達が多く、リーダ格で社交上手な才があり、多くの人に人気があって共に栄える博愛精神を有し、不遇な環境にあっても協力者により盛運に転ずる強運数。裏面には親分肌的な所があって、ひとの面倒を良く見ますが、逆に利用されて損をしないように注意が必要です。」"],
  "17": ["意志強固な霊位を示す吉祥数", "「強い意志と活動旺盛な自身家タイプ。感情が鋭く積極性に富む強運数だけに、自我が強く出て強引過ぎると、意見の対立を起こして失敗したり、短気からの失敗を招くことになります。自我を慎むと、明るい人柄が多くの人の信頼と人気を得て、成功運を強めます。また裏面には、情に脆い面がありますから、情に絡んで損をしないように注意が必要です。」"],
  "18": ["意志強固な霊位を示す吉祥数", "「曲がった事に嫌いな正直者。強い信念で大業成就の成功運ですが、自我が出て過剰に過ぎますと相手を敵に回す結果となります。自己の目的にみに走らず寛大さと他人への敬愛の念を養うことで、多くの人の信望を集めて発展します。また裏面には、情に脆い面がありますから、情に絡んで損をしないように注意が必要です。」"],
  "19": ["困難障害波乱の霊位を示す凶運数", "「知能に優れて、事業や仕事に才能を発揮するが、実力が生かされず人生に波乱曲折が多く、健康を害したり、事故や障害などにより中途行き詰まり易い。智力や直感力の鋭さがこの数の天与ですから、これを磨くこと、頭の良さを仕事の道で活かすことが成功のポイントです。裏面に、空虚で飽き性な落ち着きのなさがありますから、浮動しやすい者は困難が多く、人のために損をしがちな人生となります。他の数との相関により大成功者もあります。」"],
  "20": ["病弱孤独悲運の霊位を示す最凶数", "「陰気な者又は頭脳俊敏な者、湖泥の如く沈む者又は逆巻く波のごとき大活動家と両極端で、多くは努力が伴わず悲惨な人生を送ることが多く、心の平穏を欠くため人の対立も起きやすく、短気を起こして自ら孤独になり、肉親子女の縁も薄く、悲惨な人生の暗示があります。<br>単独では判断が大変難しい数で、稀に死線を越えて大成功者もいます。」"],
  "21": ["独立権威、頭領の霊位を示す大吉祥数", "「独立心が旺盛で、一歩一歩と地位と名誉を築く強運数で、人の長としての信頼を集め、前途洋々と開ける強運数だけに、若年から人を見下す欠点があり、和を欠いて敵も作ります。これを慎んでいけば弱冠にして才覚を発揮できます。+w<br>女性のあなたは、キャリアウーマンとしては大成功しますが、霊位が強すぎ、孤独相か、夫との生死別または一家を背負う運命の暗示があります。また、この数を持ていますと、夫の運勢を伸長させない暗示がありますから、安穏に夫を補佐し協調の精神を養うように心掛けてください。-w」"],
  "22": ["陰性・陰湿、二相の霊位を示す大凶数", "「意志薄弱にして暗い気性。神経質過ぎて人との和を欠きやすく、中途挫折、辛抱強さの欠落で思うに任せて職場も変わりやすく、健康を害し家族縁も薄く、不和などのため孤独に見舞われる暗示があります。裏面は片意地な自己本位、調子の良い時にはがらりと変わる二重人格のようなところがあります。自己の限界をわきまえ、忍耐力と相手に対する和合態勢を養わないと、対人関係に苦労が多くなります。+o<br>対人運にこの数字があるあなたは特に注意が必要です。-o」"],
  "23": ["隆運盛大、頭領の霊位を示す大吉祥数", "「偉大なる智徳と敢闘精神にあふれる強運数だけに、感情が鋭く人とのトラブルも起きますが、挫けない強さが天与の統率力となり、大業成就の成功運が一代で財と地位を築きます。+w<br>女性のあなたは、キャリアウーマンとしては大成功しますが、霊位が強すぎ、孤独相か、夫との生死別または一家を背負う運命の強い暗示があります。また、この数を持っていますと、夫の運勢を伸長させない暗示がありますから、安穏に夫を補佐し協調の精神を養うように心掛けてください。-w」"],
  "24": ["興産宝財運の霊位を示す大吉祥数", "「才智豊かな興産運にして、物資四方より集まり来たり。財運にも恵まれる幸運数。協調性と丸みのある人柄が、人望を集めて次第に財をなす事ができます。+w<br>あなたが既婚なら、温和で家庭運も良く、しっかり者で円福家タイプが多いのもこの数の天恵です。-w」"],
  "25": ["理智的で個性の強い霊位を示す吉数", "「個性が強くいささか強情で、言葉に皮肉が出やすく、自己過信になると裏面の少々偏屈な面が出て、人との対立による不利不幸を招きます。また、極端に走ると失敗をしますから、人との調和に心掛ければ、手腕家で挫けない強さを活かすことができ、大業成就します。」"],
  "26": ["波乱英雄変怪な霊位を示す凶運数", "「英雄的な親分肌で、情も厚く大物に見える反面、片意地で偏屈な好き嫌いの強い個性があるため、こちらが表に出ると、不和が生じ不利不幸を招き、波乱の人生となります。個性が活かされ良い意味に作用すると強い発達運となるのですが、多くは個性が活かされず不和波乱の多い人生になります。<br>また、父親と意見の合わない者もあり、こういう人は相手の立場に立って報恩の念を養う努力が必要です。」"],
  "27": ["自我挫敗の霊位を示す凶運数", "「頭を下げるのを嫌う自信家タイプ。智力と努力で名声を得ますが、自我が強すぎて、非難や反感を受けても意に介さない強情さが、次第に協力者を得られなくなり敗北に終わる暗示が強い。中年までに名実共に得る者と、中年以降に良くなる者の二通りがあります。また、父親と意見の合わない者もあり、こういう人は相手の立場に立って報恩の念を養う努力が必要です。+s<br>晩年運にこの霊位が現れているあなたは特に、自我を慎み、相手に対する敬愛の念を養うようにしないと、晩年はみじな人生になります。-s」"],
  "28": ["不和変転の霊位を示す大凶数", "「人生に波乱屈曲が多く、非難や誹謗を受けて中途挫折しやすく、自我過剰で何事にも意に介さないため、家庭的にも孤立し、親族の縁も薄く、離別したり苦労の多い凶運数です。また、父親と意見の合わない者もあり、こういう人は相手の立場に立って報恩の念を養う努力が必要です。」"],
  "29": ["智謀と直感力の霊位を示す吉数", "「直感力が鋭く、活動力も旺盛で知力・権力・財力を得るボス的な手腕家だけに、勢いに任せて失敗を招くこともありますから、自己反省しながら進む雅量を合わせ持つ事が大業成就させ安泰を保つ秘訣です。+w<br>女性のあなたは、男勝りになりやすく、夫婦不和による別離などの傾向がありますから、順和雅量を養えば幸運を得ることができます。-w」"],
  "30": ["浮沈多く、一進一退の霊位を示す吉凶相半数", "「物事に根気がなく飽き性な性格が表に出れば浮沈の多い人生になります。また気迷いせず一筋道に専念すれば強い発展運となり成功を勝ちえます。投機的な諸事に走ると、一家離散など悲惨な人生の暗示がありますので、着実に進む努力が必要です。」"],
  "31": ["陰陽和合の輪郭ある霊位を示す大吉数", "「温和、雅量に富み、協調性と積極性のある人柄が大物として人望を集め、富栄名声を得て、家庭的・社会的にも恵まれ、実業家、教育家などいずれの社会でも頭角を現し、おごることなく安泰発展の大吉祥数とされています。+w<br>女性のあなたは円満タイプです。この霊位を持つ女性には才色兼備のラッキー型が多いです。-w」"],
  "32": ["引き立て運の誘導のある霊位を示す大吉数", "「福禄多望な天分ある温和な性格が人気を呼んで、目上の引き立てを得て福徳を受け、たとえ変転があっても協力者によって晩年安泰の強運数です。しかし、自惚れは慎まないと協力者を失ってしまいます。+w+j<br>主運にこの霊位の現れている女性のあなたは、雅量のある人柄が人気運となり、晩年は安泰な人生でしょう。-j-w」"],
  "33": ["旺位四辺を圧する極盛の霊位を示す大々吉祥数", "「凡人には身に過ぎる危険あり。(他の数が全て吉数で健康運に恵まれなければ、逆効果となる。)　才略優秀なる者は、旺盛な発展をし名声が天下を轟く立派な成果となる。小才無力なるものは失意に嘆く結果となる。名付けでは使用を避けるべき数です。+w<br>女性のあなたは、強烈な孤独相を示し、強運に乗じて女傑などを生ずる。-w」"],
  "34": ["破壊波乱、悲運の霊位を示す最凶数", "「散る、乱れる、壊れるの暗示のある悲運数で、事故遭遇や身内のトラブルなどが起きやすく、事業の倒産、病弱など肉体的・精神的に薄幸の傷心が続き、晩年孤独に終わる悲運数とされています。+j<br>主運にこの数字が現れているあなたには、特に強く作用しますので注意が必要です。<br>-j+s晩年運にこの数字が現れているあなたには、特に強く作用しますので注意が必要です。-s」"],
  "35": ["福寿円温和の霊位を示す吉数", "「温良和順すぎて権力型でないだけに、社会に頭角を博するような成果を上げられないきらいがあります。+m<br>男性のあなたは、下手なところで意地を張る面は慎んで、実行力と積極性を養えば、幸運数だけに、発展・成功に繋がります。<br>-m+w女性のあなたは、温和な性格がよい面で、貞淑で家事に行き届き、良妻型が多く、技芸・文学などの分野では成功を得ます。-w」"],
  "36": ["波乱変動、英雄的な霊位を示す凶運数", "「英雄的な親分肌なところがあり、情も厚く人の心を汲みますが、偏屈者で物事一方に片寄り過ぎてトラブルを起こし、平穏を欠き孤立しやすい暗示があります。謙虚な姿勢がコツです。<br>また、父親と意見の合わない者もあり、こういう人は相手の立場に立って報恩の念を養う努力が必要です。」"],
  "37": ["篤実単行、繁栄の霊位を示す吉祥運", "「独立単行、智力胆力に優れ大業成就の強運で万難突破、独立権威の数だけに、反面、行き過ぎますと孤立する危険性があります。人との和合に心掛ける事が安泰発展の秘訣です。+w<br>女性のあなたは、過剛になりますと、孤立しますから分をわきまえたいものです。-w」"],
  "38": ["温和従順、弱性の霊位を示す吉数", "「努力家なるも活動力が欠ける為に、目的の達成が難しい。権力的な野望のある者は、人との対立を生じますから、自己の限度をわきまえて無理をせず、従順に努力をすれば発展します。<br>知的な学者、文芸家方面では優れた才覚を発揮できます。」"],
  "39": ["波乱富貴、徳望のある霊位を示す吉数", "「才智に富み権力徳望に恵まれ、才能を活かし指導力があり、衆人の信望も厚く、地位と名声を得る成功運です。権力的な野望に走ると、裏面に波乱の凶相がありますから、謙虚さがないと吉変じて波乱の人生ともなりかねません。+w<br>女性のあなたは、キャリアウーマンとしては成功しますが、霊位が強すぎ、孤独相か、夫との不和不幸を招く暗示があり、注意が必要です。-w」"],
  "40": ["知謀と胆力の霊位を示す吉凶相半数", "「智力胆力が備わり発展もしますが、波乱浮沈の分岐点にあって、知謀にたけ決断力に富むだけに高慢なところがあり、人の意見に意を介さない面が、人との争いを生じ衰運に向かうことになります。<br>謙虚な姿勢で、良き協力者を得るように努めれば、知謀と胆力、決断力が自己発展の原動力になります。」"],
  "41": ["有徳富栄、和順の霊位を示す大吉祥運", "「協調性と決断力がある人柄が、稀に見る大物として衆人の信望を集め、着実に前進します。地位と名声を得られる強運数で、実業家、教育家、指導者のいずれの面に於ても健全発展の幸運数です。+w<br>女性のあなたは、明朗で温和な人柄が好かれ幸恵を享する幸運数です。-w」"],
  "42": ["散漫、不如意の霊位を示す凶数", "「技能技芸に長じ、器用で何でもこなしますが、意志薄弱で信念が乏しい為、一芸に長ずることがなく器用貧乏になりやすい。社交上手ですが、意志が弱い点で人に利用されて損をしたり、積極性が欠け平凡な人生となります。意志強固なる者は、成功運につながりますから、強い信念で一芸に徹することが成功の秘訣です。」"],
  "43": ["意志薄弱の霊位を示す凶数", "「才能がありながら意志薄弱な信念の無さが、物事成就しがたく、強い信念を持って才能を伸ばさないと、不遇な人生になる暗示がある。派手好みで、多情、多恨、異性問題も起きやすいので、意志強固に信念を貫くことが安泰の秘訣です。」"],
  "44": ["病弱、離散、孤独の霊位を示す凶数", "「神経質で病難に苦しみ、家庭運も悪く、災厄重ね来たりでノイローゼになる者など、ツキのない人生の暗示があります。稀に、怪傑、偉人、烈婦など出ずるが、一般に苦労が多く神経質の偏屈者が多いようです。」"],
  "45": ["知謀、知略の霊位を示す吉祥数", "「智略に秀で、意志強固で、能力に恵まれ、決断力に富み、目的到達、難事をいとわぬ意志の堅さが人の信頼を集めて大業成就する強運数です。人によってはとっつきにくい面もあります。<br>人との調和に心掛ければ、親切で誠実な性格が好かれて強い発展運につながります。才智を表面化すると孤立する危険がありますので、注意が必要です。」"],
  "46": ["変怪波乱、吉凶相半の霊位を示す凶数", "「順調の如くも結果を得られず、中途で難破する暗示と、苦労の末大成功者となる暗示など、変転波乱の数で、人によっては偏屈者として見られるなど不安定な人生となります。+s<br>晩年運にこの霊位の現れているあなたは、一歩一歩と地歩を固めながら、人との調和に心掛けて良き協力者を得ないと、晩年の安泰は望めない悲運薄幸な運命となります。-s」"],
  "47": ["忠実精励、開花の霊位を示す大吉祥運", "「温和でまじめな努力家で、努力の末に花開く強運数で、世渡り上手と誠実な人柄が敵を作らず、衆人の信頼を集めまして晩年盛運、幸慶を享受できる大吉祥運です。真面目な努力家です。+w+u<br>良縁玉のこしに乗る暗示あり、ラッキーです。-u-w」"],
  "48": ["才智、徳望、冷静の霊位を示す大吉祥運", "「冷静な行動力と才知に長け、先見力に優れた才覚と、静穏な人柄が稀に見る大物として信望を集め、富み栄え、晩年幸福に満ちる大吉祥数です。+w<br>女性のあなたはやり手の賢妻タイプですが、夫を立てるようにすると、さらに幸運になります。-w」"],
  "49": ["吉凶紙一重、変化の霊位を示す吉凶相半数", "「吉を得れば吉重なり。凶を導けば困難多く、もがけば失敗を来たす。晩年は平穏を欠くか、変転運の暗示がありますから、冷静さと手堅さをわきまえて調子に乗らない謙虚さが必要です。稀に、大発展を修める者もいます。」"],
  "50": ["一盛一衰、波乱没落の霊位を示す凶数", "「発展もし成功にもつながるが、災厄多難の裏面があり、得て失うの相とされています。焦らず調子の良い時も余り調子に乗らず、自分の限界をわきまえて、一歩一歩と堅実な姿勢で中年以降に備える必要があります。」"],
  "51": ["隆盛、浮沈の霊位を示す吉凶相半数", "「波乱変動が自然に凶兆する暗示があります。隆盛運に乗ると名声と地位を得て発展しますが、いつしか事が上手く回らなくなって落ちぶれてゆく衰運を裏面に蔵していますから、盛運時にはあまり調子に乗らず、変転時もやけにならず、人との争いを避け、良き協力者を得る慎重さがないと、安泰は保てない事を肝に命じておきましょう。」"],
  "52": ["気力胆力、有徳の霊位を示す大吉祥数", "「計画遂行の先見運と進展力により、無より有を生ずる強運数で、難事に当たっても挫けない気力と胆力で大志大業を貫徹、子孫長久、晩年安泰の旺盛な発展を成します。+w<br>女性のあなたは幸福な人生を送れます。-w」"],
  "53": ["変転、浮沈、困苦の霊位を示す凶運数", "「内実に意を得られず、障害多難の多い挫折の暗示を持ち、浮沈変化の激しい運命を辿ります。+s<br>晩年運にこの霊位が現れているあなたは、周囲の意見を尊重して良き協力者を得るように協調性を養わないと、安定を欠き、晩年は、不遇薄幸に終わります。-s」"],
  "54": ["障害、辛苦、不如意の霊位を示す凶運数", "「直感力が鋭いだけに性急過ぎて、結果を得難いなど、計画倒れになる事が多く、不和や損失を繰り返し悲惨な人生の暗示があります。一歩一歩と堅実に進む冷静さを養うことが安泰の秘訣です。」"],
  "55": ["極成の裏面に大欠陥の霊位を示す吉凶数", "「盛運に乗じて失敗する一盛一衰の暗示があります。調子に乗らない事が成功の秘訣であり、意志強固にして事を進める雅量と、他人と協調できる順和を養えば、成功につながります。意志薄弱な者は失意に嘆く凶意があります。」"],
  "56": ["損逸災厄の霊位を示す大凶数", "「意気乏しく、実行の勇気と進取の気質がなく、迷い心が多いため中途挫折しやすい暗示がある弱運数です。+s<br>晩年運にこの霊位の現れているあなたは、気力と胆力を養い、一業に徹して、気迷いを捨てて辛抱強く事にあたる気構えと実践力で、人生を乗りきれば晩年の安泰も望めます。-s」"],
  "57": ["資性英敏、一陽来福の霊位を示す大吉祥数", "「有徳、富栄、高名の天恵のある強運数なだけに、剛気果断に走ると失敗もあります。剛気を慎み、心の寛大さと人との和合に努めることで、天恵ある名誉を晩年まで安泰に及ぼし吉祥繁栄をさせることができます。」"],
  "58": ["浮沈波乱の霊位を示す凶運数", "「決断力に欠けるため安定を欠き、苦難や辛苦の暗示ある弱運です。不遇時にも挫けない信念を養い、自我を慎み他人との協調性に努めて、良き友を持ち、積極的に自己啓発する気概と実行の勇気を持つことが必要です。敗北主義に陥ると不遇な人生となります。」"],
  "59": ["薄志不成就の霊位を示す凶数", "「意志薄弱にして迷いを生じ、忍耐の乏しさが周囲の者と対立して片意地になるため、損厄苦難が多く、協力者を失ったり、家族と対立して悲痛の多い暗示があります。<br>忍耐と辛抱強さを養い、片意地を張らず、実直に努力する必要があります。」"],
  "60": ["不安空虚の霊位を示す大凶数", "「進退ままならぬ不安動揺に苦しむ暗示あり。失意、傷心、晩年孤独の悲運数ですから、冷静さと謙虚な姿勢で気迷いを捨てて、一筋道に対処しないと、孤独不遇までが重なりかねません。」"],
  "62": ["名利栄達の霊位を示す大吉祥数", "「天賦の幸恵を享受し、名声、地位、財運に恵まれる強運数だけに、自我が強すぎると、裏面に悲運もあり、人との対立から不和を招き、家庭内でもトラブルを起こし幸恵を逃しますから、自我を慎み人との調和融合する心の寛大さを養うことが大切です。」"],
  "62": ["志望達せず内外不和を生ずる凶相数", ""],
  "63": ["目的達成、憂患なく子孫繁栄、一身平安の吉祥数", ""],
  "64": ["波乱変怪、災禍多い凶相、病難、事業困厄の凶数", ""],
  "65": ["長寿盛運、隆昌発展、良運権名の三徳具全の吉祥数", ""],
  "66": ["進退苦悩、災厄重ね来る生涯不平、安泰を得ない凶数", ""],
  "67": ["資性和暢、万事支障なく目的伸長、家運盛大の吉祥数", ""],
  "68": ["勤勉力行、発展名利を得て幸慶を享ける吉祥数", ""],
  "69": ["困難障害、病災悲業、不和論争の凶相数", ""],
  "70": ["空虚悲哀の凶兆あり、不和失意を生ずる暗示ある凶相数", ""],
  "71": ["富栄発展の意、発展奏行あるも貫徹ならない吉数", ""],
  "72": ["外見吉のごとく、内面は凶相を含む吉凶相半数", ""],
  "73": ["志望高くも実行力乏しく、業を破る外容偉、内客空の数", ""],
  "74": ["無能徒食の象、不遇破綻の凶相数", ""],
  "75": ["内面破敗多く、努力せば吉祥を得る相半の数", ""],
  "76": ["一家離散、逆難病弱来る亡身の凶相数", ""],
  "77": ["前半不遇、中年開花する二相の暗示のある数", ""],
  "78": ["智力あり、成功発展あるも吉凶禍福、晩年は困難哀兆の相を示す数", ""],
  "79": ["精力欠乏、節義道徳心なく、世上不用の凶相数", ""],
  "80": ["終生困苦、波乱辛惨に悩み、病災を生じる凶相数", ""],
  "81": ["最極数にして元に一数に還帰自然の霊力旺盛、基数の1と同じ。万物のスタート新生発展の霊位を示す吉祥数", "「たとえ環境が不遇でも、富と幸福に恵まれ発展する強運数だけに、独立単行になりやすく敵も作ります。独走を慎んでいけば、困難を克服して地位や財運に恵まれて幸福な人生が展開します。」"]
];