var kanji = {
  "1": "くしつのへノフヘレ一乙っーー弌丿",
  "2": "いうこてとひめりるろんアイカクコスセソトナニヌハヒマムメヤユラリルワ入力丁人二了乃又刀ぺプペぃぅァィャュン卜几匕弍貮貳〆厶",
  "3": "あえかけさすせそちにみもやゆよられわゐウエオキケサシタチツテミモヨロヱヲ己上小大川土弓口工子千寸丈久凡士女三下山亡丸干也巳巾勺刃夕凡ぐじづべぴブベパピぁぇゃゅょゥェォョヶッ已广叉兀于乞弋个孑",
  "4": "きたぬねはふまむをネホヰ天文井今犬内午斗夫及介方化火片公切木斤日毛元孔四支氏仁心水丹太中月手戸友止反比引分升予才王牛欠父不丑之巴允爪尹刈凶幻互尺少冗弔屯匹匁厄ごでどびガグゴズゼゾドバビおぉ苅廿牙匂壬尤仍勿卞亢兮勾仇弖戈无云曰仄",
  "5": "ほゑ穴尼甘五生功出市石永丘央巨可加皮甲北句兄玄古札左白示司主末世仙正外代巧他田民立冬布平丙母本矢由用令史氷右充占仕玉包目半未召以叶弘只旦卯瓦丼瓜疋乏凹且刊去叫冊皿失囚申斥凸奴必付矛幼がげざずぜぞぢぱぷギゲザジダヂヅデポ申斥付矛幼な尻乎禾ヴ孕仟弁仔丕叨夘夲仭弗仞冰仗乍屶册圦凧匝它冉叺卮巵",
  "6": "六合有安交至糸色印宇打衣多収各灰休共吉机求血光好再在早西式次臣朱全先宅竹地寺年同仲羽舟伏帆米曲向名百羊行匠老仰自回存兆肉守虫如考旭伊匡伎圭伍庄汀亘丞亥冴臼此吐牟而汁犯因缶企危朽刑件后旨字耳旬舌任伐妃朴妄吏列劣凪亦ぎだばぶぽボ州宍舛收曳曵凩戎屹亙戌圷伉夛聿夷尖朿杁冲夙艸价夸朶弛朷耒吃吋虍吊刎艮",
  "7": "赤足歩池言伯役江尾延男忍克改形汗我角貝完君均吟岐希究更呉攻佐坂作里伺伸志私杉住助吹束村谷告利床伴努初兵秀良但成車見辛町余妙七弟低冷坊身杏宏吾佑李亨酉辰汐呂伶甫胤串牡宋佃杆牢坐壮杖忘伽冶号汚吸忙毎位何含忌却狂局系孝坑困災材似序走妥呈廷投豆尿妊判否別卵免死杜邑仏ぼ壮伽冶邨杣豕糺杞呑巫釆杢壯汎孜佛豸夾些灼戒汲杠汝吽岑庇妖禿劬彷呀劭佞侫佝坏扛佚妓杓妍旱托攸估兌冏屁址阯吠甬佇孚汕妛劫吭",
  "8": "青明味姉亜依居到岩委受妹姓承枝易炎把沖折佳快岳金彼固京協奇季空弦決孤児昆定妻周使所舎垂征卒宗卓忠武知坪的典取長尚直林服肌念八房府物巻松牧店命夜門幸享和宙政岸雨東板乳叔官来昇於欣玖虎采朋奈昌昂沙侑旺叔岡斧庚杵坤其咏奄帛阜徂玖扱争両汽技抗抄状沈批扶没抑戻往卸果拐怪劾宜供具屈券呼肯刻刷始刺事炊制昔析底毒届杯版非放奉枚岬盲例糾弧卑孟尭汰侃社侍枡兒亞來徠桝汪宕秉昊舛沓隹兔忽枇杷岫卦函凾咄杳旻卷帖坡兎岨岻刹枕岱竺盃杭祀佰岾姐昏峅祁侈亰妬竒枌侖冽佯枩羌沃杼乕佶宛姑氓妾盂隶侘忤或孥杪坦呰柩呵姆找抒枋抖艾崗杲劼岼岷穹咆沌汾咒呪佼爬沁佩忻恊沚侏坩軋兩",
  "9": "相秋昭厚後油軍泡勇泉祈芋威美押屋泳治垣重型河界科肝革風香春九客姫紀紅首建計是前亭度怒飛峠泊波抜音則肩待南皆室柳保泰律勉俊信俗姿宣映拓染柱柄省砂表要畑貞肖赴面炭奏施法断客契咲星沼促段致突帝品彦虹亮哉怜柾柊栂畏迴柏柿祇狗狐肚俣柚甚辻柴栃肘肛柵粂盈侠紂込払即沿泣拒況拘祉招性拙注抽抵泥拝拍披泌侮沸抱奔抹哀姻疫皇架看冠軌虐急係故枯郊侯査昨削思柔盾食侵帥牲耐怠訂秒負封便某冒盆約幽厘奎勁胡昴眉宥怕湶柘姜眄廻姥昶柑垰姪兪虻况韭竿娃炳籾炯烱曷瓱韋癸眇畍俚俐侶姶剋尅沫泓垪臥拇俄亟囿狛朏枷很垓枳杤昜哘峙俟紆姚炬柞柬柁芒俑垠禹咸怡徇姦爰頁怖弭泱拂拜矧閂扁咽垢剌怨泙柯矜怨屏垳砌昧毘剃沂沽枸奕怏拈哇酋泄拌沱俔炮笂拆",
  "10": "十畔洗員家活埋育馬笑扇恩鬼起宮兼夏株格狩神花恭校気氣級記耕候庫洪貢高剛恒哲真島時拾財宰乗徐座針酌席栓祖素孫託朕秩津庭粉洞流指珍根原芳倫肥益峰紋洋留破持訓桑芝射紙納展宴倉軒差城師紡討般倍芽容旅晃晏衿桐紗秦朔晋隼芹矩祐桂栗洲紘玲芥哥烏討修笈峨珂肩城砧倖絋股眞栢恂借師恕酒純芙桃釜珀栖桎砧砥弱畠栞併肪巡迅径効肢括峡拷恨臭祝挑派肺案翁蚊害核恐個娯航骨唆栽索疾准書宵症辱娠粋畝隻租息値恥畜衷徒唐凍倒特配俳班秘疲俵病紛倣俸砲剖娘耗料烈者迦峻洵洸拳倖恕晟啄唄凌倭芙修純栞峯祗栫崋剥唖桓笄赳釘舫髙娟鄕畚芭娜秤耘桔凄芬恰桁羔髙閃洙哩玻袁圃晄娚卿蚓豹狹狠耆蚣殷倶祠埆窄珊晒肱栩挧恢翅弉躬珈芯拵冥倩虔娥洌祟耿洩晉按倪袂栲拿拏勍娑哮宸框拮笊痔唏狢釡窈恷烋倬恍埒埓乘恣埃亳峪峩畄奘秧迂戝紊洶皰哢紐竝並耽眩恆狡屑畆們拯珎冢訊秡峽烝砦倚釖恪俶哺晁洽洫奚哨恃粍埖眥眦徑逕哦倡辿肴",
  "11": "章麻彩乾移項唱動得浮梅浦英悦海帯御教終側堅紺勘基寄救規崎魚近組邦国区區健啓研康許参悟細将宿常祥紳茂紫若巣専設雪背曹崇船帳彫眺粒釣偵笛第敏堂野望販返掘祭朗狭唯浪婦庸張悠眠偶浴密鳥眼商族頂務停苗習斜昼袋麦問梓苑浩彬鹿茅寅彪眸茉晧那梨茄笹笙柚彗畦庵桶貫笠粕梶釧皎笹従珠雀狸苔袋務梯袢梁符偕埜壷啄雫篠范麥処仮迎条苦邪胃悔既挟叙勅胞飢殺消浸匿被捕域械患婚産執赦蛇寂術庶渉訟紹推責旋措粗窓窒豚軟粘婆敗培舶票貧副閉偏崩欲翌率略累偉圏晩硫毬菫袈絃梧皐偲晨爽紬悌崚梢残殊殉珠従訪條崔嵜國嵜苫尉晤舩絆瓷浬兜﨑浯祥笳瓸撝羚苺敕堵袖椛梗梵帷振浚舵將埴斬笘涌梛凰苛梠﨑敎祥釼埼胎笥硅胛苣頃圀舸勒浹娵苙捐珪涎苧婉苓浙袰假涓晞桾狼挺戚牽梟悉悧唾竟烽梳專帶苳晝甜崙崘晢梃舳焔紲晦祚浤苡啅斛舷笶曼捍婢蛉處涅崕婁烹堆苻挨翊悛殍聆挾崖唹泪從从胥崟梭弸皋胄絅堀勗捉珥婀崢捩祓啝畢苹堊紿畩馗胚眷苒參",
  "12": "晶浅荒幾壱植雲恵惠越衆雄勝寒掛開閑喜景清淑筋給草黒現混策茶最場掌情捨森深順粧視盛詞善晴然添尊疎能替猛為絶貯着堤邸棟筒登統胴弐番発棚博迫筆結労勞涼税等防尋朝賀間敢殻浄球植授探淡短硬強程雅理茜敦惇斐絢嵐凱喬欽稀智椎惣巽淳須淡絲雁期貴蛛阪袴曽晧脇棉淀硯筐堺筑淵粟茨棹椙壷場蛭画迭単胸脅裁桟脂脈涙悪異液黄貨涯虚控採剰据惜接掃悼盗排詠街割款棺棄棋欺喫距減雇絞詐酢散傘軸集就循証詔硝焦診婿訴創喪貸堪超痛答童鈍買媒費悲扉備評普復幅塀報貿棒帽傍無絡痢量裂惑腕虜傑捺椋迪惟媛竣翔猪述殊期貴象富捷渕喬堯筬棕冨琉悸阮黍粥祷淺曾曽窘皓晧喧茲莊堰掠晰斌脊釉皓荊絮蛯痣粡筏捗喰壹壱爲挽淋僅斯囲圍斑敞弼淨珸琅瑯蛤捻裄觜壻聟掫皖犀椅涵棲媚瓠捧塲蛟掬喉煉發淙悽壺壷硲喨茗喞荏閏閠猜筈椀筌凉猊愽啼馮棗椚啻閔棘忰悴涸蛙邱閖茸徨悵茱洛絳颪淕嵎焙喩廸淦椌淹屡淤堙椒渮彭棧堡啾傀喘渊硴筍笋戟箏筝茹喚雰棯覗棆傅訶舒掟嵌篏辜靱靭淮淘悶椥痩棠寐袷掴椨椏犁犂孳靫掏惚剴袿邵淆惘悋暃茵捫淒胯寓絖椶淞捶焚掀甦喃賁竦",
  "13": "会會愛揚暑当新意飯裏園煙円圓鉛想幹荷解勤極絹義敬経港歳嗣路聖荘資詩鈴勢退稚塚伝傳附鼓照渡猫農鉢裕湯雷乱亂電琴寛補塔猶提零廉碑禁傾装塩跳殿督阿暉渥郁萩楠嵯椿渚靖琢稔睦稜禄莉鳩椰楓脩耶楊湧琳裟舜當碓奧琥湘馳殿蜂碇稗楯喬蕎塞蛸楢暎楷揖雉詮爺鼠楳援莞塙莞茎阻逆砕送追逃迷唇挿悩瓶渇脚掲粛脱描握飲奥渦換揮湿煮測惰募愉廊酪暗暇嫁靴塊該較感頑詰業愚群嫌誇碁債載催試酬愁傷詳睡跡塑賊暖賃艇塗働煩微盟預話賄雌銃殖萌詢瑞頌嵩援筧楡雍薗湊碆荻煌湖捲睚莊稟禀皙填荻湊塚湍莪穉楫勠荵愃鈷頓虞蜍愆愡鉦莇陀詫睫惺榁塚靖暘裡琶楚嗄碕煥煤楜渫誄椹渠湮湲湃渭莱揆馴駲琵鈎絛綏莎惷煎莢賈塘羣幌杰湟鉈釶猩椴稠裙渣渺跨榔鉉僧楞嗚湫莫絽楸嗔塒碗傲綛肆痲湛厦廈游罫楮鉞粲揶媾莨祺楪搭辟鼎楔媽塋詣渟禽稙楙莅肅碍窟傭揃亶雹琺莠惶渾莖衙愈暈雋綟彙筥經鳰鼡楾愕梦綉嗟莚揣粳睛暄旒荼煦揩戡愎蜉渝莟迹鉤鈎筰鉋猷莓犹碌塢皷",
  "14": "彰維歌栄榮猿置温像管算軽華飼境旗菊銀郡態源寿豪実實造酸誠慎滋準説精誓端通連溝溶与輿領郎綿速図銅途滑菜寝裸団種対對台搬福聞酵舞獄鼻鳴透魂察枠綱認幕夢線綾嘉榛翠禎輔菖颯暢緋碧熊爾瑚瑛綜肇滉魁綺瑳碩鳳綸綱飴榎菅窪溪榊嶋銑誦槇箕萠槍逗裾槌獅綜菱誥糀菰鉾鳶郡慈趙逢瑚尽斉齊限降称粋逝捜逐菓偽菌渓著慌脹揺禍褐搾署奨飾損嘆墓飽滅誕賓箇寡閣疑誤語構酷誌需塾製駄奪嫡寧罰閥腐僕網誘踊僚緑罪瑶槙慈銑壽榧銘溜與團愼萄熙煕熈廏廐厩榑瑁稱漣嶌嶋蜜臺榕閨籏蜘萓迺廼郞塹圖萢裼僖蜷箔餌溥嗹溢綯裴赫愿菴榴竪箘箟閤搖蝋菁曄這鞆靹綵綴翡槐翆綬菩萍貍裳萎輕搦睿滄斡菻噌甃僮陏箙嶂愬誡菲尓搆瑙碯滔聚碵萃琿蝕層携攜銚槞廖夐槃搓愨陌馼褄盡瑜韶箜凖菘誣腔奬獎粹裨滓獏嘗瘋褂銓慊僊跿嶄槓罨銖箒嘛逅蜻蔆厭榿緇廓僑嫖賑熏燻愧",
  "15": "輝熱稲逸院売賣漆緒億慮興落漢確影賢数儀暮慶剣賞進敷陣墨節調摘徹徳部範腹葉箱広廣摩万萬満養楽輪腰郭談盤幣編演縁鋭閲趣慣漁弾滴締練葵槻駒蝶諒瑠慧毅醇寛葛駕毅瑳諏樋萩幡樟箸増糊萱董翫磅樫葦磐写欧殴価枢除陛慰惨週酔逮脳郵歯葬廃慨践滞腸漠楼緯課稼緩監窮緊劇稿暫賜質熟衝審震請槽駐墜敵踏輩賠罷標賦弊舗褒暴魅憂窯履寮論概穀磁漸憎徴漬髪漂複慕慢漫様漏漱嬉煕誼諄醇凛黎増模舖萩鴇凜劍劒劔剱滿碼漉鞍鋪葩瑩賤賎緤樗嫺嫻昤廟韮霆葺菟莵蝦漕劉樂鴉膓鋒箭箴德廚厨蝉悳槿髭瘟緞葭熨逞葎稻彈數瑤麹鋤樅磊篇噂摺魯逧鴈鳫篁麾蝮鋲墫摯腱璢麩麸腋嘴儁葡儚葱槫樞墮堕慥葷葆磋嶐醉駛滸瑪樒櫁瘧稷霄漓嘶陞褌嶝嬌踞緘羯磔瞑幢瑰輦腎霈幟頬葫廠厰潁緝瑣蝣蝴稽禊歐陦畿蝸墸駝諚萪腥",
  "16": "暁篤勲陰器潮潤運衛横学學潟樹潔機憲壁蛍螢縦渋澁静錠澄積銭達築蓄陳都灯燈道頭橋磨頼導撤糖諸陶陸陵親鮎樺亀龜錦橘蒼蓉璃猪鴨縣醐醍樽龍鋸播辨壇蒔膀諜賭蒲霖錆豫諌諫頴縛餘県縣陥剤竜陪過遇焼遂遍遊違蒸戦頻凝憩鋼衡墾錯錘整濁曇燃奮謀輸融録謁餓撮潜諾墳噴撲黙歴暦憧叡燎儒諭儘曉鮒蓋葢盖撫艘燕蓬靜衞澗聳霍憐蒋霍憐糘蓊憫穐蓑簑簔蓬膂鴫縒勳翰橸遁錫逹諦潘霎蒜蓙鴛逵篩諮餐盧橙燐穎頴穆篝醒箆篦閻瑾諧磧彊錚鮑憙縞鞘侭輯璋燗撰諷縢蒐躾鴦瞠樵橡輻樸甑霙罹鬨豎熹撞潯蒿蓁潰撚嚆斈憬熾磬蒡憚冀潦錢墺徽撒骸撥赭髻駮橲蓚錐蹄鴣霏遖諺蟆蟇蒙窺褥螂撩諳臻暹",
  "17": "営營遠応應憶鍛謙郷階倹儉斎霜沢澤繁縫錬濃陽穂隅総操隆館独獨優励勵鮮聲磯聡蓮瞳弥嶺黛霞鞠駿檀蔦澪燦曙瞭嶽蔭隈鍬鍵篠鍋桧檜總壇鳶錨橿糖績鮫餅鵄暮圧壓声択拒担点逓検檢隊遣禅瞬嚇轄擬矯講購懇擦謝醜縮償礁燥濯謄療憾激謡擁隷戯撃膚憤膜拠績彌舘齋檎穗穗聰縷簗韓糟濵隆瓢詹禪曖糠瞰篶隆艚篷蔚縲蓼蔀鍾罅鍜螺檬聨聯鍔朦蔡禧譁嘩鮭澳檐縵燭戴蔗簀牆墻嬬懋懃餡醤懍儡撻燮嶷蹊濂闇繋膤檍隋暸筱膠磴檗蘗嚀嶼覬燵膝鮪遜縹鴾謠璞闊濶鮟鞜繆嬰翳蔓盪蘯繍簓闍窿壕糞",
  "18": "織環騎雑鎮浜濱礼禮謹挙擧曜獲帰歸豊鎌鯉麿鴻雛燿曙鵜蕃鎚馥儲簣旧舊医済転塁隔額簡顔鎖職繕礎題覆癖癒糧臨爵翼膨遮遭適蕗蕉礒旛旙濟膳瞹贄繦鎗濤涛濵蕀櫃鎭鎧櫂雜襍竄鎬繹檸叢鞭瀞鄙蕪蕨豐濡醫濠謳鵙甕檮飜襖雙双鼬歟戳鵤擢壙魏瞿璧蕊蕋蘂嚠鵝鵞鎔熔梼顎釐翹鎹濔繚黠濬襄魎蟲鵠檳梹褝襌騏蕩轉蹟壘穢濘",
  "19": "絵繪穏霧鏡識関観難縄薪障麗襟勧拡擴類鯛遼鵬臆櫛簾蟹蟻猟遅辞韻願繰璽爆簿離穫繭贈懲濫獣薦薄遺賛遵選遷際薙鯨遥遙禰祢袮麓鄭胆膽獵猟胆膽關蕭鶇鯖礪砺騨簽鏑麒櫟檪櫓瓣薔鯰蝿蠅擾薜膺蕾曠昿轍瀑簸薛蹴鯱薇瀉鶉鵺齏霸瓊靡寵薊臂羸曝羹羮顛鵡贊韵韜譚膿鏨瀏鵲薐廬壟繩蠍疇畴壞壊穩證攀蕷蟷贇疆襠檻瀦潴櫑",
  "20": "厳薫鐘覚覺蔵藏継嬢瀬宝寶滝露羅耀藍馨薩藁炉党釈訳献触議競懸籍警譜騒闘犠齢還避隣懐瀧糲寳矍饗瀨邁鐐鰐枦櫨孃瀨驀譯鐙騰釋鰕壤糯鶫蠣蛎壌壤瀚罌繻薺薹嚶黨瀛飃飄嚴礫躅藉竇繼籌饅礦砿瀟鰊鰈竸鐔鹹朧",
  "21": "桜櫻薬続續鉄鐡誉譽鶏護翻覇藤鶴謹鶯籔芸藝険属艦顧魔躍欄藩懷駆藪薮鴬鐵銕龝籐籘藥纐纈轟軣纏纒鶲辯辧鰭饒鐸随隨駈驅竈竃藜邀鬘巍瀲鐶爛儷罍寉蠢鷄懺鰤鰯籃瀾魑鰰驃囃瓏瀰艪麝屬遽",
  "22": "隠権摂辺邊蛮駅響穣芦鰻鴎籠權窃畳襲藻聴歓鋳読覧鑓蘆邉蘇蘓篭鬻攝讀邃鱈轡瓔珱鑄鰺鯵驍藺迩邇穰欅鬚懿艫舮鷓覽鷙躑聽隱霽臙黐籟歡藹",
  "23": "体體顕鉱恋戀変巌蘭麟駅鷲灘鑑驚髄験繊鑢欒巖顯躰軆灑鱗鱒靨攪撹纓鷯鑛驗鰹籤鷦",
  "24": "霊艶鷹譲鷺塩鹽蚕醸臓嘱譲鑪鈩羈覊讓軈軅隴鬢靄鱧矗攫襷艷",
  "25": "観蛮蠻庁籬觀鑰蘿靉",
  "26": "湾讚讃鬮驥邏",
  "27": "鱸邏鑽鑚鱸鑼顳驩驤黷",
  "28": "欟鑿",
  "29": "鬱欝驪爨",
  "30": "鸞"
};

console.log('Loading function');

var aws = require('aws-sdk');
var s3 = new aws.S3({apiVersion: '2006-03-01'});
exports.handler = function(event, context) {
console.log('Received event:', JSON.stringify(event, null, 2));
//console.log('[access_key_id]:' + aws.config.credentials.accessKeyId);
//console.log('[secret_access_key]:' + aws.config.credentials.secretAccessKey);
//console.log('[session_token]:' + aws.config.credentials.sessionToken);
    s3.getObject({Bucket:"data.seimei.asia", Key:"kanji.json"},
        function(err,data) {
            if (err) {
                console.log(err);
                context.fail(err.message);
            } else {
                var kanji = JSON.parse(data.Body);
                var kakusu = null;
                for (var key in kanji) {
                    if (kanji[key].match(event["sei"])) {
                        kakusu = key;
                    }
                }
                context.succeed(kakusu);
            }
        }

    );
};

